{"data":{"markdownRemark":{"html":"<p>An execution context is an isolated layer in the bundling cycle that is allocated a set task that generalizes the concept of bundling in Packem.</p>\n<p>Previously, we’ve mentioned that Packem uses OS-specific precompiled binaries to handle bigger tasks in the bundling cycle such as module graph generation. However, to integrate with tools like Babel and such, a custom runtime in Rust would be necessary. However this means much more than it sounds. Creating an entire runtime in Rust that strictly follows ECMAScript’s standards is exceedingly difficult, yet not impossible.</p>\n<p><strong>Packem does not exclusively rely on JavaScript (Node)</strong> especially where heavy operations are concerned. A workaround is to use FFI bindings to be able to allocate a specific task to each layer of Packem. Each layer is called an <em>execution context</em> and there exists only two such contexts:</p>\n<ul>\n<li><strong>Runtime Context (RC)</strong> - The portions of Packem that are best represented in JavaScript on Node. The JavaScript source-to-source compiler, graph serializer, basic optimizations and a few other domains within Packem’s core are hoisted here. There is a shared issue between both layers especially in our case where the RC happens to take the position of being the mainstream context in the Packem Model so Node startup times and V8 side effects are still persistant.</li>\n<li><strong>Logical Context (LC)</strong> - This section entails most of the logic Packem uses to instantiate and rehydrate the module graph. It is written strictly in Rust and in most cases, performance-critical parts are abstracted into this layer. However, exceptions to this rule do remain especially in the domains of Packem not having support for them in the moment.</li>\n</ul>\n<h2 id=\"contextual-precautions\"><a href=\"#contextual-precautions\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Contextual Precautions</h2>\n<p>Switching between the LC and RC can cause a performance delay since the FFI bindings yield the effect with an extra overhead causing build times to be a bit higher. This is why:</p>\n<ul>\n<li>Necessary decisions are made before hand in the RC to avoid unnecessary calls between the two layers.</li>\n<li>A minimal functional interface is exposed to the RC.</li>\n<li>Non-performance-critical parts of Packem are regressed into the RC.</li>\n</ul>\n<blockquote>\n<p>Note</p>\n<p>Mutation of the module graph can occur anywhere between the LC and the RC</p>\n</blockquote>","frontmatter":{"title":"Execution Contexts","next":"advanced-plugin-apis.html"},"fields":{"path":"content\\docs\\execution-contexts.md","slug":"docs/execution-contexts.html"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"docs/execution-contexts.html"}}